<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
<META NAME="Generator" CONTENT="Microsoft Word 97">
<TITLE>sol57</TITLE>
<META NAME="Template" CONTENT="C:\ARCHIVOS DE PROGRAMA\MICROSOFT OFFICE\OFFICE\html.dot">
</HEAD>
<BODY LINK="#0000ff" VLINK="#800080">

<P>PROBLEMA 57</P>
<P>Nicol&aacute;s Rosillo.</P>
<P>Dpto. Matem&aacute;ticas, IES M&aacute;ximo Laguna.</P>
<P>Santa Cruz de Mudela, Ciudad Real</P>
<P>nrosillo@olmo.pntic.mec.es</P>
<B><P>En un tri&aacute;ngulo rect&aacute;ngulo, el radio de la circunferencia inscrita mide <IMG SRC="Image43.gif" WIDTH=86 HEIGHT=21>, con <I>a</I> y <I>b</I> catetos y <I>c</I> hipotenusa.</P>
</B><P>Sin p&eacute;rdida de generalidad, se puede suponer una configuraci&oacute;n como la siguiente:</P>
<P ALIGN="CENTER"><IMG SRC="Image44.gif" WIDTH=476 HEIGHT=286></P>
<P>La circunferencia inscrita ha de ser tangente a los 3 lados del tri&aacute;ngulo, por lo que en los puntos de intersecci&oacute;n los radios han de ser perpendiculares a los lados, lo que indica que para la figura dada la longitud del radio es el valor absoluto de <I>w</I>. As&iacute;, una primera condici&oacute;n sobre (<I>z</I>,<I>w</I>) supuesto el incentro se obtiene escribiendo la ecuaci&oacute;n de la circunferencia de centro (<I>z</I>,<I>w</I>) y radio <I>w</I>.</P>
<P ALIGN="CENTER"><IMG SRC="Image45.gif" WIDTH=154 HEIGHT=24></P>
<P>e imponiendo que un punto (<I>x</I>,<I>y</I>) de la misma est&eacute; en el lado (0,<I>b</I>)(0,0):</P>
<P ALIGN="CENTER"><IMG SRC="Image46.gif" WIDTH=45 HEIGHT=18></P>
<P>a la que a&ntilde;adimos la condici&oacute;n para que el radio trazado en dicho punto sea perpendicular a ese lado:</P>
<P ALIGN="CENTER"><IMG SRC="Image47.gif" WIDTH=84 HEIGHT=21></P>
<P>Eliminado <I>x</I> e <I>y</I> en esas tres ecuaciones se obtiene la ecuaci&oacute;n</P>
<P ALIGN="CENTER"><IMG SRC="Image48.gif" WIDTH=68 HEIGHT=21></P>
<P>como muestra la figura siguiente, describiendo parte de una sesi&oacute;n con Mathematica.</P>
<P ALIGN="CENTER"><IMG SRC="Image49.gif" WIDTH=480 HEIGHT=90></P>
<P>La ecuaci&oacute;n obtenida relaciona (<I>z</I>,<I>w</I>) con las coordenadas de los v&eacute;rtices del tri&aacute;ngulo.</P>
<P>An&aacute;logamente, haciendo lo mismo con el lado (0,<I>b</I>)(<I>a</I>,0), se obtienen las ecuaciones</P>
<P ALIGN="CENTER"><IMG SRC="Image45.gif" WIDTH=154 HEIGHT=24></P>
<P ALIGN="CENTER"><IMG SRC="Image50.gif" WIDTH=113 HEIGHT=21></P>
<P ALIGN="CENTER"><IMG SRC="Image51.gif" WIDTH=149 HEIGHT=21></P>
<P>a partir de las cuales, por eliminaci&oacute;n, se deduce una segunda condici&oacute;n para determinar las dos coordenadas del incentro:</P>
<P ALIGN="CENTER"><IMG SRC="Image52.gif" WIDTH=269 HEIGHT=24></P>
<P ALIGN="CENTER"><IMG SRC="Image53.gif" WIDTH=480 HEIGHT=110></P>
<P>Resolviendo el sistema formado por las dos ecuaciones obtenidas, resultan las coordenadas del incentro en funci&oacute;n de las coordenadas de los v&eacute;rtices del tri&aacute;ngulo:</P>
<P ALIGN="CENTER"><IMG SRC="Image54.gif" WIDTH=480 HEIGHT=244></P>
<P>El hecho de obtener cuatro soluciones no debe sorprender, puesto que existen cuatro posibles circunferencias tangentes a los lados de un tri&aacute;ngulo, una interior al tri&aacute;ngulo y tres exteriores a &eacute;l. Se supone en todo momento tri&aacute;ngulos no degenerados, esto es, <IMG SRC="Image55.gif" WIDTH=84 HEIGHT=21>.</P>
<P>La segunda soluci&oacute;n muestra la soluci&oacute;n al problema propuesto, puesto que <I>w</I> vale exactamente <IMG SRC="Image43.gif" WIDTH=86 HEIGHT=21>, y las otras tres soluciones muestran una propiedad no menos curiosa; a saber:</P>
<P>Los radios de las circunferencias tangentes a los lados de un tri&aacute;ngulo rect&aacute;ngulo miden <IMG SRC="Image56.gif" WIDTH=361 HEIGHT=21>.</P>

<APPLET CODE="CabriJava.class"  WIDTH="480" HEIGHT="470" archive="CabriJava.jar">
      <param name="lang" value="en">
      <param name="bgcolor" value="#F0F0CC">
      <param name="file" value="sol57.fig">
</APPLET>
</BODY>
</HTML>
